<?php
//Задание 1
$i = 0;
while ($i < 100) {
    $i++;
    if ($i % 3 == 0) {
        echo("$i;");
    }
}
//Задание 2
echo("<br/>");
$i = 0;
do {
    if ($i == 0 ) {
    echo("$i - это ноль <br>");
    } else if ($i % 2 == 0){
        echo("$i - это четное число <br/>");
    } else {
        echo("$i - это нечетное число <br/>");
    }
    $i++;
} while ($i < 11) ;
echo("<br/>");
//Задание 3
$localCity = [
    "Московская область" => [
        "Москва",
        "Зеленоград",
        "Клин",
    ],
    "Ленинградская область" => [
        "Санкт-Петербург",
        "Всеволожск",
        "Павловск",
        "Кронштадт",
    ],
    "Рязанская область" => [
        "Рязань",
        "Щацк",
        "Сасово",
    ],
    "Нижегородская область" => [
        "Нижний Новгород",
        "Кстово",
        "Бор",
    ],
];
foreach($localCity as $key => $value){
    echo("<br>$key:<br>");
    foreach($localCity[$key] as $key => $value){
        echo("$value, ");
    }
}
//Задание 4
$letters = [
    "A" => "a",
    "Б" => "b",
    "В" => "v",
    "Г" => "g",
    "Д" => "d",
    "Ё" => "e",
    "Е" => "e",
    "Ж" => "zh",
    "З" => "z",
    "И" => "i",
    "Й" => "y",
    "К" => "k",
    "Л" => "l",
    "М" => "m",
    "Н" => "n",
    "о" => "o",
    "П" => "p",
    "Р" => "r",
    "С" => "s",
    "Т" => "t",
    "У" => "u",
    "Ф" => "f",
    "Х" => "kh",
    "Ц" => "ts",
    "Ч" => "ch",
    "Ш" => "sh",
    "Щ" => "shch",
    "Ъ" => "",
    "Ы" => "y",
    "Ь" => "",
    "Э" => "e",
    "Ю" => "yu",
    "Я" => "ya",
    " " => " ",
    "." => ".",
    "," => ",",
];
function getTranslit($letters, $strig){
    $strArray = explode(".", $strig);
    $finalStr = "";
    foreach ($strArray as $keyRus => $valueRus){
        foreach ($letters as $key => $value){
            if ($valueRus == $value) {
                $finalStr = $finalStr . $value;
            }
        }
    }
    return $finalStr;
}
$strForTranslit = "Образовательный портал создает условия для реализации основных профессиональных образовательных программ и программ дополнительного образования с применением исключительно или частично электронного обучения и предоставляет доступ к различным электронным образовательным ресурсам, находящимся в системах электронного обучения в закрытом или открытом доступе.";
echo("<br>");
var_dump(getTranslit($letters, $strForTranslit));
echo("<br>");
echo(getTranslit($letters, $strForTranslit));