<?php
//Задание 1
$i = 0;
while ($i < 100) {
    $i++;
    if ($i % 3 == 0) {
        echo("$i;");
    }
}
//Задание 2
echo("<br/>");
$i = 0;
do {
    if ($i == 0 ) {
    echo("$i - это ноль <br>");
    } else if ($i % 2 == 0){
        echo("$i - это четное число <br/>");
    } else {
        echo("$i - это нечетное число <br/>");
    }
    $i++;
} while ($i < 11) ;
echo("<br/>");
//Задание 3
$localCity = [
    "Московская область" => [
        "Москва",
        "Зеленоград",
        "Клин",
    ],
    "Ленинградская область" => [
        "Санкт-Петербург",
        "Всеволожск",
        "Павловск",
        "Кронштадт",
    ],
    "Рязанская область" => [
        "Рязань",
        "Щацк",
        "Сасово",
    ],
    "Нижегородская область" => [
        "Нижний Новгород",
        "Кстово",
        "Бор",
    ],
];
foreach($localCity as $key => $value){
    echo("<br>$key:<br>");
    foreach($localCity[$key] as $key => $value){
        echo("$value, ");
    }
}
//Задание 4